In [1]:
file = open('data.csv','x')
file.close()

In [1]:
import pandas as pd
df = pd.read_csv('data.csv',nrows=4)
df

   sn   name  age         add        phone
0   1    Ram   34   Kathmandu   9808778765
1   2  Shyam   54  Bhaktapuer  98098778765
2   3   Hari   32    Lalitpur   9808778765
3   4  Sabin   45       Jhapa   9808778765

In [1]:
import pandas as pd
df = pd.read_csv('data.csv')
# df.head()
df.head(5)

   sn   name  age         add        phone
0   1    Ram   34   Kathmandu   9808778765
1   2  Shyam   54  Bhaktapuer  98098778765
2   3   Hari   32    Lalitpur   9808778765
3   4  Sabin   45       Jhapa   9808778765
4   5  Nabin   56     Chitwan   9808778765

In [3]:
df.tail()

   sn    name  age         add        phone
1   2   Shyam   54  Bhaktapuer  98098778765
2   3    Hari   32    Lalitpur   9808778765
3   4   Sabin   45       Jhapa   9808778765
4   5   Nabin   56     Chitwan   9808778765
5   6  Sabina   33   Kathmandu   9808889876

In [4]:
df = pd.read_csv('data.csv',usecols=['sn','name','age'])
df

   sn    name  age
0   1     Ram   34
1   2   Shyam   54
2   3    Hari   32
3   4   Sabin   45
4   5   Nabin   56
5   6  Sabina   33

In [5]:
df = pd.read_csv('data.csv',index_col='sn')
df

      name  age         add        phone
sn
1      Ram   34   Kathmandu   9808778765
2    Shyam   54  Bhaktapuer  98098778765
3     Hari   32    Lalitpur   9808778765
4    Sabin   45       Jhapa   9808778765
5    Nabin   56     Chitwan   9808778765
6   Sabina   33   Kathmandu   9808889876

In [6]:
df[['name','add']]

      name         add
sn
1      Ram   Kathmandu
2    Shyam  Bhaktapuer
3     Hari    Lalitpur
4    Sabin       Jhapa
5    Nabin     Chitwan
6   Sabina   Kathmandu

# iloc

In [7]:
df.iloc[2:5]

     name  age       add       phone
sn
3    Hari   32  Lalitpur  9808778765
4   Sabin   45     Jhapa  9808778765
5   Nabin   56   Chitwan  9808778765

In [8]:
df.iloc[2:3]

    name  age       add       phone
sn
3   Hari   32  Lalitpur  9808778765

In [9]:
df.loc[2:5]

     name  age         add        phone
sn
2   Shyam   54  Bhaktapuer  98098778765
3    Hari   32    Lalitpur   9808778765
4   Sabin   45       Jhapa   9808778765
5   Nabin   56     Chitwan   9808778765

In [10]:
df['name']

sn
1       Ram
2     Shyam
3      Hari
4     Sabin
5     Nabin
6    Sabina
Name: name, dtype: object

In [2]:
df[df['name'] == 'Ram']

   sn name  age        add       phone
0   1  Ram   34  Kathmandu  9808778765

In [3]:
df[df['age']  > 40]

   sn   name  age         add        phone
1   2  Shyam   54  Bhaktapuer  98098778765
3   4  Sabin   45       Jhapa   9808778765
4   5  Nabin   56     Chitwan   9808778765

In [4]:
df[(df['age']  > 40) & (df['name'] == 'Nabin')]

   sn   name  age      add       phone
4   5  Nabin   56  Chitwan  9808778765

# # dict to dataframe

In [5]:

data = {'name':['Ram','Shyam','Hari'],
        'age':[34,56,67],
        'add':['Kathmandu','Bhaktapur','Lalitpur']}
df = pd.DataFrame(data)
df

    name  age        add
0    Ram   34  Kathmandu
1  Shyam   56  Bhaktapur
2   Hari   67   Lalitpur

In [8]:
import os
files = os.listdir()
if 'info.csv' in files:
  print("Yes")
else:
  print("No")

No

In [9]:
pwd

'C:\\Users\\dklom\\6--- prakash-BB-pandas'

In [11]:
"/content"

'/content'

In [12]:
import datetime
date = datetime.datetime.now()
print(str(date))

2023-11-28 09:15:30.821360

In [13]:
# list inside list to csv file
import csv
data = [['Ram',34,'Kathmandu'],
        ['Shyam',45,'Bhaktapur']]
file = open('new_info.csv','w')
x = csv.writer(file)
x.writerows(data)
file.close()

In [15]:
import csv
csv_columns = ['Name', 'Age', 'Address']
dict = [
    {'Name':'Aayush','Age':23,'Address':'Katmandu'},
    {'Name':'Shyam','Age':33,'Address':'Patan'}
]

csvfile = open("data.csv", 'w')
writer = csv.DictWriter(csvfile, fieldnames=csv_columns)
writer.writeheader()
for data in dict:
    writer.writerow(data)

csvfile.close()